<!-- الفرق بين post ,get:
1.  GET:
   - تستخدم عندما تحتاج إلى إرسال بيانات من خلال عنوان URL
   - يتم إرسال البيانات كجزء من عنوان URL، مما يعني أنها مرئية للمستخدمين
   - يمكن استخدامها لنقل بيانات قليلة وغير حساسة مثل البحث
   
   مثال:

   <form action="process.php" method="get">
       <input type="text" name="username">
       <input type="submit" value="Submit">
   </form>
  
   في هذا المثال، سيتم إرسال قيمة الحقل `username` كجزء من عنوان URL.

2.   POST:
   - تستخدم عندما تحتاج إلى إرسال بيانات بشكل خفي داخل الطلب.
   - البيانات التي ترسل عبر POST لا تظهر في عنوان URL، مما يجعلها أكثر أمانًا لنقل المعلومات الحساسة.
   - يمكن استخدامها لنقل كميات كبيرة من البيانات مثل نماذج التسجيل.

   مثال:
  
   <form action="process.php" method="post">
       <input type="text" name="email">
       <input type="submit" value="Submit">
   </form>
   في هذا المثال، سيتم إرسال قيمة الحقل email بشكل خفي داخل الطلب -->
